[
    {
        "name": "LOCATION1",
        "description": "Ти опинився на безлюдному острові. Ваш круїз зазнав краху і зараз ти один - один у піщаній бухті. Перед собою ти бачин скелистий берег, а за ним джунгі - туди так просто не дістатися. По ліву та по праву руку від тебе лише пісок та море (або океан).",
        "events": [{
                "name": "EVENT1",
                "id": 1,
                "description": "Ти голодний і хочеш пити. Треба щось робити, а інакше ти помреш: ",
                "choices": [
                    {
                        "descripion": "1. Піти ліворуч",
                        "reference": 2
                    },
                    {
                        "descripion": "2. Піти праворуч",
                        "reference": 3
                    }]
            },
            {
                "name": "EVENT2",
                "id": 2,
                "description": "Отямившись, врешті-решт ти обрав рухатись. Ти пішов ліворуч з надією знайти когось, хто теж вцілів, або, хоча б, знайти припаси. Пройшли години і ти побачив силует жінки, що лежить на піску. Тобі здалося що це марево, але ти підійшов ближче. Вона лежить непритомна: ",
                "choices": [
                    {
                        "descripion": "1. Спробувати привести її до тями",
                        "reference": 5
                    },
                    {
                        "descripion": "2. Піти далі",
                        "reference": 6
                    }]
            },
            {
                "name": "EVENT3",
                "id": 3,
                "description": "Отямившись, врешті-решт ти обрав рухатись. Ти пішов праворуч з надією знайти когось, хто теж вцілів, або, хоча б, знайти припаси. Пройшли години і ти побачив поселення на берегу. Можливо, вони зможуть допомогти: ",
                "choices": [
                    {
                        "descripion": "1. Підійти ближче і попросити про допомогу",
                        "reference": 4
                    },
                    {
                        "descripion": "2. Піти далі",
                        "reference": 6
                    }]
            },
            {
                "name": "EVENT4",
                "id": 4,
                "the_end": true,
                "description": "Ти вирішив не втрачати нагоди і спробувати знайти поміч. Ти підходиш ближче до поселення і бачиш навколо кістки, ще, нещодавно, живої істоти. Тебе помітили місцеві. Вони людожери і, нажаль, сьогодні ти став їх обідом.",
                "choices": []
            },
            {
                "name": "EVENT5",
                "id": 5,
                "description": "Нажаль, вона мертва. Треба рухатись далі.",
                "choices": []
            },
            {
                "name": "EVENT6",
                "id": 6,
                "description": "Вже вечоріє. Треба знайти прихисток.",
                "choices": []
            }]
    },
    {
        "name": "LOCATION2",
        "description": "Сонце вже сідає а навколо тебе все ще лише пісок та скелі.",
        "events": [{
                "name": "EVENT7",
                "id": 7,
                "description": "Ти у роздумах: як же тобі провести ніч",
                "choices": [
                    {
                        "descripion": "1. Йти далі"
                    },
                    {
                        "descripion": "2. Заночувати під скелею",
                        "reference": 9
                    }]
            },
            {
                "name": "EVENT8",
                "id": 8,
                "the_end": true,
                "description": "Ти вирішив йти далі. Врешті-решт ти натрапив на пошукову команду. Тепер ти в безпеці. Ти вижив",
                "choices": []
            },
            {
                "name": "EVENT9",
                "id": 9,
                "the_end": true,
                "description": "Ти вирішив заночувати на пляжі. Але ти все ще не пив та не їв більше 2 діб. Заснути через жагу та голод ти так і не зміг. До того ж, ніч була дуже холодною. Ти почав втрачати сили, і врешті-решт ти зміг закрити очі. Але ти так і не прокинувся. Ти помер. ",
                "choices": []
            }]
    }
]
